# Cursor/VS Code Extensions
# Install with: cat ~/.config/Cursor/extensions.txt | grep -v '^#' | xargs -L 1 cursor --install-extension
# Or run: omarchy-cursor-extensions install

# AI & Coding Assistants
# (Cursor has built-in AI, but you may want additional extensions)

# Language Support
ms-python.python
ms-python.vscode-pylance
rust-lang.rust-analyzer
golang.go
ms-vscode.cpptools

# Web Development
dbaeumer.vscode-eslint
esbenp.prettier-vscode
bradlc.vscode-tailwindcss

# Git
eamodio.gitlens
mhutchie.git-graph

# Editor Enhancement
vscodevim.vim
streetsidesoftware.code-spell-checker
usernamehw.errorlens
christian-kohler.path-intellisense

# Themes (extensions defined in each theme's cursor.json)
# Install all themes at once or just the one you use
catppuccin.catppuccin-vsc
arcticicestudio.nord-visual-studio-code
enkia.tokyo-night
jdinhlife.gruvbox
sainnhe.everforest
qufiwefefwoyn.kanagawa
mvllow.rose-pine
kepano.flexoki-vscode
robbowen.synthwave-vscode
monokai.theme-monokai-pro-vscode
zhuangtongfa.material-theme

# File Support
redhat.vscode-yaml
tamasfe.even-better-toml
mechatroner.rainbow-csv

# Remote Development
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-containers

# Productivity
alefragnani.project-manager
gruntfuggly.todo-tree

