# Cursor Extensions - Minimal Set
# Install with: cosmikase-cursor-extensions install

# Python
ms-python.python
charliermarsh.ruff
meta.pyrefly

# Rust
rust-lang.rust-analyzer

# C/C++
ms-vscode.cmake-tools
xaver.clang-format

# Mojo
modular-mojotools.vscode-mojo

# Julia
julialang.language-julia

# Themes (for cosmikase theme system)
catppuccin.catppuccin-vsc
arcticicestudio.nord-visual-studio-code
enkia.tokyo-night
jdinhlife.gruvbox
sainnhe.everforest
mvllow.rose-pine
